TKW/contrib/ITK_2_01_Test_Messages/Acknowledgements/Fault_ACK/FAULT_mustUnderstand-0000.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header>
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:SendInfrastructureAck-v1-0</wsa:Action>
		<wsa:To>__SENDTO__</wsa:To>
		<wsa:From>
			<wsa:Address>http://localhost:4000</wsa:Address>
		</wsa:From>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__TIMESTAMP__</wsu:Created>
				<wsu:Expires>__EXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>TKS Server test</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<itk:DistributionEnvelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<itk:header service="urn:nhs-itk:services:201005:SendInfrastructureAck-v1-0" trackingid="2D37D9CA-5223-41C7-A159-F33D5A914EB5">
				<itk:addresslist>
					<itk:address uri="urn:nhs-uk:addressing:ods:RX8"></itk:address>
				</itk:addresslist>
				<itk:auditIdentity>
					<itk:id type="2.16.840.1.113883.2.1.3.2.4.18.27" uri="urn:nhs-uk:identity:cfh:nic:lab:itk-demonstrator"/>
				</itk:auditIdentity>
				<itk:manifest count="1">
					<itk:manifestitem mimetype="text/xml" base64="false" compressed="false" id="uuid_E808A967-49B2-498B-AD75-1D7A0F1262D7" encrypted="false"/>
				</itk:manifest>
				<itk:senderAddress uri="urn:nhs-uk:addressing:ods:RX8:DrA"/>
				<itk:handlingSpecification>
					<itk:spec value="urn:nhs-itk:interaction:ITKInfrastructureAcknowledgement-v1-0" key="urn:nhs-itk:ns:201005:interaction"/>
				</itk:handlingSpecification>
			</itk:header>
			<itk:payloads count="1">
				<itk:payload id="uuid_E808A967-49B2-498B-AD75-1D7A0F1262D7">
					<InfrastructureResponse xmlns="urn:nhs-itk:ns:201005" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" serviceRef="urn:nhs-itk:services:201005:SendCDADocument-v2-0" result="OK" timestamp="2005-03-29T13:24:36.000" trackingIdRef="2D37D9CA-5223-41C7-A159-F33D5A914EB5">
						<reportingIdentity>
							<id type="2.16.840.1.113883.2.1.3.2.4.18.27" uri="urn:nhs-uk:identity:cfh:nic:lab:itk-demonstrator"/>
						</reportingIdentity>
						<errors>
							<errorInfo>
								<ErrorID>mustUnderstand</ErrorID>
								<ErrorCode codeSystem="2.16.840.1.113883.2.1.3.2.4.17.268"></ErrorCode>
								<ErrorText></ErrorText>
								<ErrorDiagnosticText></ErrorDiagnosticText>
							</errorInfo>
						</errors>
					</InfrastructureResponse>
				</itk:payload>
			</itk:payloads>
		</itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>