TKW/contrib/ITK_2_01_Test_Messages/Acknowledgements/Negative_Acknowledgement_Templates/DE_INVMCT_BusinessAck_SOAPandDIST_Primary.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header>
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:SendBusinessAck-v1-0</wsa:Action>
		<wsa:To>__SENDTO__</wsa:To>
		<wsa:From>
			<wsa:Address>http://localhost:4000</wsa:Address>
		</wsa:From>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__TIMESTAMP__</wsu:Created>
				<wsu:Expires>__EXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>TKS Server test</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<itk:DistributionEnvelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<itk:header service="urn:nhs-itk:services:201005:SendBusinessAck-v1-0" trackingid="2D37D9CA-5223-41C7-A159-F33D5A914EB5">
				<itk:addresslist>
					<itk:address uri="urn:nhs-uk:addressing:ods:RX8"></itk:address>
				</itk:addresslist>
				<itk:auditIdentity>
					<itk:id type="2.16.840.1.113883.2.1.3.2.4.18.27" uri="urn:nhs-uk:identity:cfh:nic:lab:itk-demonstrator"/>
				</itk:auditIdentity>
				<itk:manifest count="2">
					<itk:manifestitem mimetype="text/xml" base64="false" compressed="false" id="uuid_E808A967-49B2-498B-AD75-1D7A0F1262D7" encrypted="false" profileid="urn:nhs-en:profile:ITKBusinessAcknowledgement-v2-0"/>
				</itk:manifest>
				<itk:senderAddress uri="urn:nhs-uk:addressing:ods:RX8:DrA"/>
				<itk:handlingSpecification>
					<itk:spec value="urn:nhs-itk:interaction:ITKBusinessAcknowledgement-v1-0" key="urn:nhs-itk:ns:201005:interaction"/>
				</itk:handlingSpecification>
			</itk:header>
			<itk:payloads count="1">
				<itk:payload id="uuid_E808A967-49B2-498B-AD75-1D7A0F1262D7">
				  <v3:BusinessResponseMessage xmlns:v3="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
				  <v3:id root="7D6D9D40-AE1A-11DB-97F8-B18E1E0994CD" /> 
				  <v3:creationTime value="201107121534" /> 
				  <v3:interactionId root="2.16.840.1.113883.2.1.3.2.4.12" extension="urn:nhs-itk:interaction:primaryRecipientNonCodedCDADocument-v1-0" /> 
				  <v3:acknowledgedBy3 typeCode="AA">
				  <v3:conveyingTransmission>
				  <v3:id root="7D6D9D40-AE1A-11DB-97F9-B18E1E0994AA" /> 
				  </v3:conveyingTransmission>
				  <v3:acknowledgementDetail typeCode="IF">
				  <v3:code code="LOCAL1234567" codeSystem="1.2.3.4.5.6.7.8.9.0" displayName="For Information display name" /> 
				  </v3:acknowledgementDetail>
				  </v3:acknowledgedBy3>
				  <v3:communicationFunction1 typeCode="SND">
				  <v3:entity classCode="ENT" determinerCode="INSTANCE">
				  <v3:id root="2.16.840.1.113883.2.1.3.2.4.18.22" extension="urn:nhs-uk:addressing:ods:Y88764:G1234567" /> 
				  </v3:entity>
				  </v3:communicationFunction1>
				  <v3:communicationFunction typeCode="RCV">
				  <v3:entity classCode="ENT" determinerCode="INSTANCE">
				  <v3:id root="2.16.840.1.113883.2.1.3.2.4.18.22" extension="urn:nhs-uk:addressing:ods:Y896543" /> 
				  </v3:entity>
				  </v3:communicationFunction>
				  <v3:controlActEvent1 classCode="CACT" moodCode="EVN">
				  <v3:author typeCode="AUT" contextControlCode="OP">
				  <v3:COCD_TP145207GB01.AssignedAuthorDevice classCode="ASSIGNED">
				  <v3:id root="2.16.840.1.113883.2.1.3.2.4.18.24" extension="DEVICEID001" /> 
				  <v3:templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145207GB01#AssignedAuthorDevice" /> 
				  <v3:assignedAuthoringDevice classCode="DEV" determinerCode="INSTANCE">
				  <v3:manufacturerModelName>LOCALManufacturerModelRef</v3:manufacturerModelName> 
				  <v3:softwareName>LOCALSoftwareName</v3:softwareName> 
				  <v3:templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145207GB01#assignedAuthoringDevice" /> 
				  </v3:assignedAuthoringDevice>
				  <v3:representedOrganization classCode="ORG" determinerCode="INSTANCE">
				  <v3:id root="2.16.840.1.113883.2.1.3.2.4.19.1" extension="Y896543" /> 
				  <v3:name>Anytown NHS Trust</v3:name> 
				  <v3:templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145207GB01#representedOrganization" /> 
				  </v3:representedOrganization>
				  </v3:COCD_TP145207GB01.AssignedAuthorDevice>
				  </v3:author>
				  </v3:controlActEvent1>
				  <v3:acknowledgedBy2 typeCode="AA">
				  <v3:conveyingTransmission>
				  <v3:id root="7D6D9D40-AE1A-11DB-97FF-B18E1E0994AB" /> 
				  <v3:controlActEvent classCode="CACT" moodCode="EVN">
				  <v3:author typeCode="AUT">
				  <v3:COCD_TP145200GB01.AssignedAuthor classCode="ASSIGNED">
				  <v3:code code="NR0080" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.124" displayName="Staff Grade" /> 
				  <v3:id root="2.16.840.1.113883.2.1.3.2.4.18.24" extension="12367890" /> 
				  <v3:templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145200GB01#AssignedAuthor" /> 
				  <v3:assignedPerson classCode="PSN" determinerCode="INSTANCE">
				  <v3:name>Jane Bristow</v3:name> 
				  <v3:templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145200GB01#assignedPerson" /> 
				  </v3:assignedPerson>
				  <v3:representedOrganization classCode="ORG" determinerCode="INSTANCE">
				  <v3:id root="2.16.840.1.113883.2.1.3.2.4.19.1" extension="Y896543" /> 
				  <v3:name>Anytown NHS Trust</v3:name> 
				  <v3:templateId root="2.16.840.1.113883.2.1.3.2.4.18.2" extension="COCD_TP145200GB01#representedOrganization" /> 
				  </v3:representedOrganization>
				  </v3:COCD_TP145200GB01.AssignedAuthor>
				  </v3:author>
				  <v3:reason typeCode="RSON">
				  <v3:detectedIssueEvent classCode="ALRT" moodCode="EVN">
				  <v3:text>Further business details relating to payload response</v3:text> 
				  </v3:detectedIssueEvent>
				  </v3:reason>
				  <v3:reason typeCode="RSON">
				  <v3:detectedIssueEvent classCode="ALRT" moodCode="EVN">
				  <v3:code code="389" codeSystem="2.16.840.1.113883.2.1.3.2.4.18.30.180999" displayName="Warning:Unexpected code; Render only">
				  <v3:originalText>Warning: Rendering only</v3:originalText> 
				  <v3:qualifier code="WG" codeSystem="2.16.840.1.113883.2.1.3.2.4.17.317" /> 
				  </v3:code>
				  </v3:detectedIssueEvent>
				  </v3:reason>
				  </v3:controlActEvent>
				  </v3:conveyingTransmission>
				  <v3:acknowledgementDetail typeCode="IF">
				  <v3:code code="LOCAL678924" displayName="FURTHER INFO" /> 
				  </v3:acknowledgementDetail>
				  </v3:acknowledgedBy2>
				  </v3:BusinessResponseMessage>
				</itk:payload>
			</itk:payloads>
		</itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>