src/main/resources/smsp/getNHSNumber.xml

<?xml version="1.0" encoding="UTF-8"?><!--This example message is provided for illustrative purposes only. It has had no clinical validation. Whilst every effort has been taken to ensure that the examples are consistent with the message specification, where there are conflicts with the written message specification or schema, the specification or schema shall be considered to take precedence-->
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:itk="urn:nhs-itk:ns:201005">
	<soap:Header>
		<wsa:MessageID>__MESSAGEID__</wsa:MessageID>
		<wsa:Action>urn:nhs-itk:services:201005:getNHSNumber-v1-0</wsa:Action>
		<wsa:To>__WSATO__</wsa:To>
		<wsa:From>
			<wsa:Address>__WSAFROM__</wsa:Address>
		</wsa:From>
		<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
			<wsu:Timestamp xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="D6CD5232-14CF-11DF-9423-1F9A910D4703">
				<wsu:Created>__WSUCREATED__</wsu:Created>
				<wsu:Expires>__WSUEXPIRES__</wsu:Expires>
			</wsu:Timestamp>
			<wsse:UsernameToken>
				<wsse:Username>__WSSEUSERNAME__</wsse:Username>
			</wsse:UsernameToken>
		</wsse:Security>
	</soap:Header>
	<soap:Body>
		<itk:DistributionEnvelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
			<itk:header service="urn:nhs-itk:services:201005:getNHSNumber-v1-0" trackingid="__TRACKINGID__">
				<itk:auditIdentity>
					<itk:id type="__AUDITIDENTTYPE__" uri="__AUDITIDENT"/>
				</itk:auditIdentity>
				<itk:manifest count="1">
					<itk:manifestitem id="__MANIFESTID__" mimetype="text/xml" profileid="urn:nhs-en:profile:getNHSNumberRequest-v1-0" base64="false" compressed="false" encrypted="false"/>
				</itk:manifest>
				<itk:senderAddress uri="__ITKSENDER__"/>
			</itk:header>
			<itk:payloads count="1">
				<itk:payload id="__PAYLOADID__">
					<getNHSNumberRequest-v1-0 xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" moodCode="EVN" classCode="CACT">
						<id root="3E25ACE2-23F8-4A37-B446-6A37F31BF77C"/>
						<code codeSystem="2.16.840.1.113883.2.1.3.2.4.17.284" code="getNHSNumberRequest-v1-0"/>
						<queryEvent>
							<Person.DateOfBirth>
								<value value="19770705" />
								<semanticsText>Person.DateOfBirth</semanticsText>
							</Person.DateOfBirth>
							<Person.Gender>
								<value code="2" codeSystem="2.16.840.1.113883.2.1.3.2.4.16.25" />
								<semanticsText>Person.Gender</semanticsText>
							</Person.Gender>
							
							<Person.Name>
								<value>
									<given>LILITH</given>
									<family>LAWALI</family>
								</value>
								<semanticsText>Person.Name</semanticsText>
							</Person.Name>
							<Person.Postcode>
								<value>
									<postalCode>SK8 5HS</postalCode>
								</value>
								<semanticsText>Person.Postcode</semanticsText>
							</Person.Postcode>
						</queryEvent>
					</getNHSNumberRequest-v1-0>
				</itk:payload>
			</itk:payloads>
		</itk:DistributionEnvelope>
	</soap:Body>
</soap:Envelope>